Repository: MMMK1307/MetafrasiSS
Catalog: src/MetafrasiSS.Web/Resources/Views/Home/Index.*.resx
Languages: de, it, ja, pt

source: About
de: Über
it: Chi
ja: 私たち
pt: Sobre

# aProgrammingTranslator
source: A Programing Translator
de: Ein Programmierübersetzer
it: Un Traduttore Di Programmazione
ja: プログラミング翻訳者
pt: Um Tradutor De Programação

# aProgrammingTranslatorText
source: Metafrasi is a tool that helps developers translate code between different programming languages. It supports languages such as Python, JavaScript, C# and C. This tool can be a valuable asset for both technology students and experienced developers. It enables students to understand code and assists more experienced developers who wish to study or migrate the primary language of a project.
de: Metafrasi ist ein Werkzeug, das Entwicklern hilft, Code zwischen verschiedenen Programmiersprachen zu übersetzen. Es unterstützt Sprachen wie Python, JavaScript, C# und C. Dieses Werkzeug kann eine wertvolle Ressource sowohl für Technologiestudenten als auch für erfahrene Entwickler sein. Es ermöglicht Studenten, Code zu verstehen, und unterstützt erfahrenere Entwickler, die die Hauptsprache eines Projekts studieren oder migrieren möchten.
it: Metafrasi è uno strumento che aiuta gli sviluppatori a tradurre il codice tra diversi linguaggi di programmazione. Supporta linguaggi come Python, JavaScript, C# e C. Questo strumento può essere una risorsa preziosa sia per gli studenti di tecnologia che per gli sviluppatori esperti. Permette agli studenti di comprendere il codice e assiste gli sviluppatori più esperti che desiderano studiare o migrare il linguaggio principale di un progetto.
ja: Metafrasiは、開発者が異なるプログラミング言語間でコードを翻訳するのを支援するツールです。 Python、JavaScript、C#、Cなどの言語をサポートしています。 このツールは、技術の学生や経験豊富な開発者にとって貴重な資産となり得ます。 学生がコードを理解するのを助け、より経験豊富な開発者がプロジェクトの主要な言語を学習または移行するのを支援します。
pt: Metafrasi é uma ferramenta que ajuda os desenvolvedores a traduzir código entre diferentes linguagens de programação. Ela suporta linguagens como Python, JavaScript, C# e C. Essa ferramenta pode ser um recurso valioso tanto para estudantes de tecnologia quanto para desenvolvedores experientes. Permite que os estudantes entendam o código e auxilia desenvolvedores mais experientes que desejam estudar ou migrar a linguagem principal de um projeto.

source: Code Translation!
de: Code-Übersetzung!
it: Traduzione Del Codice!
ja: コード翻訳!
pt: Tradução De Código!

# codeTranslationText
source: Metafrasi is able to translate code into various programming languages.
de: Metafrasi kann Code in verschiedene Programmiersprachen übersetzen. Zum Beispiel können Sie es verwenden, um print("Hello World") in console.log("Hello World") zu konvertieren.
it: Metafrasi è in grado di tradurre codice in vari linguaggi di programmazione. Ad esempio, puoi usarlo per convertire print("Hello World") in console.log("Hello World").
ja: Metafrasiは、さまざまなプログラミング言語にコードを翻訳することができます。 例えば、print("Hello World")をconsole.log("Hello World")に変換するために使用できます。
pt: Metafrasi é capaz de traduzir código para várias linguagens de programação. Por exemplo, você pode usá-la para converter print("Hello World") para console.log("Hello World").

# hello
source: Hello, It's me
de: Hallo, ich bin's
it: Ciao, sono io
ja: こんにちは、私です
pt: Olá, sou eu

# ima
source: And I'm a
de: Und ich bin ein
it: E io sono un
ja: そして私は
pt: E eu sou uma

source: Languages
de: Programmiersprachen
it: Supportati
ja: サポートされている
pt: Linguagens Suportadas

source: learn more
de: Mehr Erfahren
it: Scoprire Di Più
ja: もっと学ぶ
pt: Saber Mais

# moreAbout
source: More About Cynd
de: Mehr über Cynd
it: Di più su Cynd
ja: サインドについてもっと
pt: Mais sobre Cynd

source: More About Us
de: Mehr Über Uns
it: Di Più Su Di Noi
ja: 私たちについてもっと
pt: Mais Sobre Nós

source: Our
de: Unsere
it: I Nostri
ja: 私たちの
pt: Nossos

source: Our Supported
de: Unsere Unterstützten
it: I Linguaggi
ja: サポートされている
pt: Nossas

# ourSupportedLanguagesText
source: These are the languages we support, and the percentage represents the way to full basic translation.
de: Dies sind die Programmiersprachen, die wir unterstützen, und der Prozentsatz stellt den Weg zu einer vollständigen Grundübersetzung dar.
it: Questi sono i linguaggi che supportiamo, e la percentuale rappresenta il percorso per una traduzione base completa.
ja: これらは私たちがサポートしているプログラミング言語であり、パーセンテージは基本的な翻訳への道のりを表しています。
pt: Estas são as linguagens que suportamos, e o percentual representa o caminho para uma tradução básica completa.

source: Personal Space
de: Persönlicher Raum
it: Spazio Personale
ja: パーソナルスペース
pt: Espaço Pessoal

# personalSpaceText
source: With Metafrasi, you have the freedom to develop your projects, keep them secure, and share them with other collaborators.
de: Mit Metafrasi haben Sie die Freiheit, Ihre Projekte zu entwickeln, sie zu sichern und mit anderen Mitwirkenden zu teilen.
it: Con Metafrasi, hai la libertà di sviluppare i tuoi progetti, mantenerli sicuri e condividerli con altri collaboratori.
ja: Metafrasiを使えば、プロジェクトを開発し、それらを安全に保ち、他の共同作業者と共有する自由があります。
pt: Com o Metafrasi, você tem a liberdade de desenvolver seus projetos, mantê-los seguros e compartilhá-los com outros colaboradores.

# pleasure
source: It's a pleasure to meet you
de: Es ist mir eine Freude, Sie kennenzulernen
it: È un piacere conoscerti
ja: お会いできて光栄です
pt: É um prazer conhecê-lo

source: Services
de: Dienstleistungen
it: Servizi
ja: サービス
pt: Serviços

# siteState
source: - the site state -
pt: - o estado de site -

source: Us
de: Uns
it: Siamo
ja: について
pt: Nós

source: Wholesome Support
de: Wohlwollende Unterstützung
it: Supporto Positivo
ja: 思いやりのあるサポート
pt: Suporte Aconchegante

# wholesomeSupportText
source: Metafrasi has a support team always available to assist, along with a feedback and improvement suggestions box.
de: Metafrasi hat ein Support-Team, das immer verfügbar ist, um zu helfen, sowie eine Feedback- und Verbesserungsvorschlagsbox.
it: Metafrasi ha un team di supporto sempre disponibile per assistere, insieme a una casella di feedback e suggerimenti per miglioramenti.
ja: Metafrasiには、常にサポートするために利用できるサポートチームと、フィードバックおよび改善提案ボックスがあります。
pt: O Metafrasi tem uma equipe de suporte sempre disponível para ajudar, junto com uma caixa de feedback e sugestões de melhorias.
